/*****************************************************************************/
/**
 * \file terminal.c
 *
 * \author Соколов Сергей <sokoloff@gmail.com>
 * \author Пащенко Андрей <temnislav@gmail.com>
 *
 * \date 05.01.2017
 * 
 * \brief Настройка UART и передача данных через него.
 *
 * \details     Конфигурация UART для его последующей инициализации, создание
 *              прототипов функций для получение данных из конечных автоматов
 *              других модулей и передачи етих же данных в DMA, что реализова-
 *              но с помощью двух массивов.
 *              - terminal_uart_init - конфигурация UART.
 *              - terminal_uart_handler - копирование данных в дополнительный
 *              массив array_data_dma  откуда они отпрвляются в UART и в DMA.
 *              - наполнение массива mass_transmit_fifo данными присылаемыми
 *              конечными автоматами других модулей.
 *
 *****************************************************************************/

/*****************************************************************************
 *                            Заголовочные файлы.
 *****************************************************************************/

#include "terminal.h"

/*****************************************************************************
 *                         Локальные макроопределения.
 *****************************************************************************/

/**----------------------------------------------------------------------------
 *
 * \brief       FIFO_ELEMENTS - кол-во элементов массива для накопления данных  
 *              с автоматов
 *              ERROR_MESSAGE_LENGTH - длинна массива для передачи сообщения
 *              об ошибке
 *-----------------------------------------------------------------------------
 */

#define FIFO_ELEMENTS 100       
#define ERROR_MESSAGE_LENGTH 19   


/*****************************************************************************
 *                           Локальные типы данных.
 *****************************************************************************/

/*****************************************************************************
 *                             Локальные данные.
 *****************************************************************************/

/**----------------------------------------------------------------------------
 *
 * \brief       - UART_HandleTypeDef terminal_uart; — Обявляем имя для UART
 *              который будет пересылать данные от автоматов.
 *              - array_data_dma — массив для копирования в него данных откуда 
 *              впоследствии их будет забирать DMA и UART
 *              - mass_transmit_fifo — новной массив для получения данных 
 *              от автоматов с последующим копированием в array_data_dma.
 *              - mass_transmit_fifo_head — переменная указатель для определения
 *              элемента массива в который ведётся запись.
 *-----------------------------------------------------------------------------
 */

UART_HandleTypeDef terminal_uart;

uint8_t array_data_dma[FIFO_ELEMENTS];

uint8_t mass_transmit_fifo[FIFO_ELEMENTS];
uint8_t mass_transmit_fifo_head = 0;

/*****************************************************************************
 *                         Прототипы локальных функций.
 *****************************************************************************/

/*****************************************************************************
 *                             Локальные функции.
 *****************************************************************************/

/*****************************************************************************
 *                        Глобальные функции
 *****************************************************************************/

/**----------------------------------------------------------------------------
 *
 * \brief       Конфигурируем UART на USART1
 *
 *-----------------------------------------------------------------------------
 */

void terminal_uart_init(void)
{
  terminal_uart.Instance = USART1;
  terminal_uart.Init.BaudRate = 9600;
  terminal_uart.Init.WordLength = UART_WORDLENGTH_8B;
  terminal_uart.Init.StopBits = UART_STOPBITS_1;
  terminal_uart.Init.Parity = UART_PARITY_NONE;
  terminal_uart.Init.Mode = UART_MODE_TX_RX;
  terminal_uart.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  terminal_uart.Init.OverSampling = UART_OVERSAMPLING_16;
  terminal_uart.Init.OneBitSampling              = UART_ONE_BIT_SAMPLE_DISABLE;
  terminal_uart.AdvancedInit.AdvFeatureInit      = UART_ADVFEATURE_DMADISABLEONERROR_INIT;
  terminal_uart.AdvancedInit.DMADisableonRxError = UART_ADVFEATURE_DMA_DISABLEONRXERROR;
  HAL_UART_Init(&terminal_uart);
}

/**----------------------------------------------------------------------------
 *
 * \brief       Обработчик отправки данных через UART
 *
 *-----------------------------------------------------------------------------
 */

void terminal_uart_handler(void)
{
  if(mass_transmit_fifo_head != 0)
  {
    memcpy(array_data_dma, mass_transmit_fifo, FIFO_ELEMENTS);
    HAL_UART_Transmit(&terminal_uart, array_data_dma, mass_transmit_fifo_head, 10);
    mass_transmit_fifo_head = 0;
  }
}

/**----------------------------------------------------------------------------
 *
 * \brief       - Прототип функции для наполнения массива для последующей
 *              передачи данных.
 *              - В случае переполнения массива будет отправлено сообщение об
 *              ошибке "terminal:data lost".
 *
 *-----------------------------------------------------------------------------
 */

void terminal_send_data(uint8_t *pData, uint16_t Size)
{
  uint8_t error = 0;
  for(uint8_t i = 0; i < (Size - 1); ++i)
  {
    mass_transmit_fifo[mass_transmit_fifo_head++] = *pData++;
    if(mass_transmit_fifo_head == FIFO_ELEMENTS)
    {
      mass_transmit_fifo_head = 0;
      error = 1;
      break;
    }
  }
  if(error == 1)
  {
    uint8_t error_message[ERROR_MESSAGE_LENGTH] = "terminal:data lost";
    for(uint8_t i = 0; i < (ERROR_MESSAGE_LENGTH - 1); ++i)
    {
          mass_transmit_fifo[mass_transmit_fifo_head++] = error_message[i];
    }
  }
}

/*****************************************************************************
 *                            Конец файла
 *****************************************************************************/