/*****************************************************************************/
/**
 * \file delay.c
 *
 * \author Соколов Сергей <sokoloff@gmail.com>
 * \author Пащенко Андрей <temnislav@gmail.com>
 *
 * \date 05.01.2017
 * 
 * \brief Настройка и обработка таймера.
 *
 * \details     Конфигурация таймера для использования его в работе конечных
 *              автоматов в других модулях проекта.
 *              - Запрос занятости автомата (находится он в режиме отсчёта
 *              таймера или нет)
 *              - Передача необходимого времени задержки в конкретный автомат.
 *              - Реализация счётчика.
 *              - Очистка флагов таймера.
 *
 *****************************************************************************/

/*****************************************************************************
 *                            Заголовочные файлы.
 *****************************************************************************/

#include "delay.h"   

/*****************************************************************************
 *                         Локальные макроопределения.
 *****************************************************************************/

/**----------------------------------------------------------------------------
 *
 * \brief       Размер массива соответствующий кол-ву автоматов которые будут
 *              обращаться к таймерам.
 *
 *-----------------------------------------------------------------------------
 */

#define DELAY_TIMER_NUMBER 5

/*****************************************************************************
 *                           Локальные типы данных.
 *****************************************************************************/

/*****************************************************************************
 *                             Локальные данные.
 *****************************************************************************/

/**----------------------------------------------------------------------------
 *
 * \brief       Объявляем таймер htim_delay работающий на таймере TIM2 .
 *
 *-----------------------------------------------------------------------------
 */

TIM_HandleTypeDef htim_delay;

/**----------------------------------------------------------------------------
 *
 * \brief       Объявляем массив в который будут записваться задержки для
 *              автоматов передаваемые функцией delay_set.
 *-----------------------------------------------------------------------------
 */

static uint32_t s_delay_timer_mass[DELAY_TIMER_NUMBER];

/*****************************************************************************
 *                         Прототипы локальных функций.
 *****************************************************************************/

void timer_decrement_i(void);
void TIM2_IRQHandler(void);

/*****************************************************************************
 *                             Локальные функции.
 *****************************************************************************/

/**----------------------------------------------------------------------------
 *
 * \brief    Обратный отсчёт таймера, для автомата представленного в списке
 *           delay_name_typedef
 *
 *-----------------------------------------------------------------------------
 */

void timer_decrement_i(void)
{
  for (uint8_t i = 0; i < DELAY_TIMER_NUMBER; ++i)
  {
    if (s_delay_timer_mass[i] != 0)
    {
      --s_delay_timer_mass[i];
    }
  }
}

/**----------------------------------------------------------------------------
 *
 * \brief    Функция для очистки флагов прерываний таймера обращающася к
 *           обработчику
 *           прерываний по таймеру TIM2_IRQHandler поскольку именно он
 *           используется нами
 *
 *-----------------------------------------------------------------------------
 */

void TIM2_IRQHandler(void)
{
  if (__HAL_TIM_GET_FLAG(&htim_delay, TIM_FLAG_UPDATE) != RESET)
  {
    if (__HAL_TIM_GET_IT_SOURCE(&htim_delay, TIM_IT_UPDATE) !=RESET)
    {
      __HAL_TIM_CLEAR_IT(&htim_delay, TIM_IT_UPDATE);
      timer_decrement_i();
    }
  }
}

/*****************************************************************************
 *                        Глобальные функции
 *****************************************************************************/

/**----------------------------------------------------------------------------
 *
 * \brief    Конфигурируем таймер и прерывания по нему, для работы и передачи
 *           данных между модулями проекта реализуемой по принципу конечных
 *           автоматов.
 *
 *-----------------------------------------------------------------------------
 */

void delay_init(void)
{
  __HAL_RCC_TIM2_CLK_ENABLE();
  
  htim_delay.Instance           = TIM2;
  htim_delay.Init.Prescaler     = 160;
  htim_delay.Init.CounterMode   = TIM_COUNTERMODE_UP;
  htim_delay.Init.Period        = 100;
  htim_delay.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  HAL_TIM_Base_Init(&htim_delay);
  
  HAL_NVIC_SetPriority(TIM2_IRQn, 0, 1);
  HAL_NVIC_EnableIRQ(TIM2_IRQn);
  
  HAL_TIM_Base_Start(&htim_delay);
  HAL_TIM_Base_Start_IT(&htim_delay);
  
}

/**----------------------------------------------------------------------------
 *
 * \brief    Функция передающая значение о степени занятости автомата.
 *           - delay_not_busy - свободен
 *           - delay_busy     - занят
 *
 *-----------------------------------------------------------------------------
 */

delay_status_typedef get_status(delay_name_typedef name)
{
  if (s_delay_timer_mass[name] == 0)
  {
    return delay_not_busy;
  }
  else
  {
    return delay_busy;
  }
}

/**----------------------------------------------------------------------------
 *
 * \brief       Функция через которую устанавливаются задержки для автоматов
 *              представленных в delay_name_typedef. Устанавливается в
 *              милисекундах.
 *
 *-----------------------------------------------------------------------------
 */

void delay_set_ms(delay_name_typedef name, uint32_t delay_time_ms)
{
  s_delay_timer_mass[name] = delay_time_ms;
}

/*****************************************************************************
 *                            Конец файла
 *****************************************************************************/