/*****************************************************************************/
/**
 * \file delay.h
 *
 * \author Соколов Сергей <sokoloff@gmail.com>
 * \author Пащенко Андрей <temnislav@gmail.com>
 *
 * \date 05.01.2017
 * 
 * \brief Настройка и обработка таймера.
 *
 * \details     Конфигурация таймера для использования его в работе конечных
 *              автоматов в других модулях проекта.
 *              - Запрос занятости автомата (находится он в режиме отсчёта
 *               таймера или нет).
 *              - Передача необходимого времени задержки в конкретный автомат.
 *              - Реализация счётчика.
 *              - Очистка флагов таймера.
 *
 *****************************************************************************/

#ifndef _DELAY_H_
#define _DELAY_H_

/*****************************************************************************
 *                           Заголовочные файлы
 *****************************************************************************/

#include "stm32l0xx_hal.h"

/*****************************************************************************
 *                      Глобальные макрооопределения
 *****************************************************************************/

/*****************************************************************************
 *                         Глобальные типы данных
 *****************************************************************************/

typedef enum                    ///список для конечных автоматов
{
  delay_test            = 0,    ///тестовый модуль
  delay_input_2,                ///свободные элементы списка
  delay_input_3,                ///свободные элементы списка
  delay_input_4,                ///свободные элементы списка
  delay_input_5                 ///свободные элементы списка
}delay_name_typedef;            ///имя списка

typedef enum                    ///статусы занятости для delay_name_typedef
{
  delay_not_busy        = 0,    ///свободен
  delay_busy                    ///занят
}delay_status_typedef;          ///имя списка

/*****************************************************************************
 *                       Прототипы глобальных функций
 *****************************************************************************/

   /**----------------------------------------------------------------------------
 *
 * \brief       - void delay_init(void) - Прототип функции для инициализации
 *              таймера htim_delay
 *              - delay_status_typedef get_status(delay_name_typedef name); -
 *              Прототип функции передающий информаци занят на данный момент
 *              конечный автомат или нет.
 *              - void delay_set(delay_name_typedef name, uint32_t delay_time);
 *              Прототип функции, которая будет передвать задержку в
 *              милисекундах для автоматов в массив delay_timer_mass.
 *-----------------------------------------------------------------------------
 */

extern void delay_init(void);

extern delay_status_typedef get_status(delay_name_typedef name);

extern void delay_set_ms(delay_name_typedef name, uint32_t delay_time);

#endif // _DELAY_H_

/*****************************************************************************
 *                             Конец файла
 *****************************************************************************/