

/*****************************************************************************/
/**
 * \file ws2812b.c
 *
 * \author Соколов Сергей <sokoloff@gmail.com>
 * \author Пащенко Андрей <temnislav@gmail.com>
 *
 * \date 14.01.2017
 * 
 * \brief Модуль управления лентой.
 *
 * \details     Для реализации управления лентой будет использоваться DMA и 
 *              прерывания от DMA, таймер TIM21 и прерывания по нему, SPI1.
 *              DMA передаёт данные в SPI1 из массива Ws281b_ArrayForTape.
 *              TIM21 используется для реализации 50мс задержки между
 *              итерациями передачи данных от DMA.
 *              
 *****************************************************************************/


#ifndef _WS2812B_H_
#define _WS2812B_H_

/******************************************************************************
 *                             ЗАГОЛОВОЧНЫЕ ФАЙЛЫ
 ******************************************************************************/

#include "stm32l0xx_hal.h"

/******************************************************************************
 *                         ГЛОБАЛЬНЫЕ МАКРООПРЕДЕЛЕНИЯ
 ******************************************************************************/

/******************************************************************************
 *                           ГЛОБАЛЬНЫЕ ТИПЫ ДАННЫХ
 ******************************************************************************/

/******************************************************************************
 *                        ПРОТОТИПЫ ГЛОБАЛЬНЫХ ФУНКЦИЙ
 ******************************************************************************/

/**----------------------------------------------------------------------------
 *
 * \brief       - Ws2812b_TimerInit — Прототип функции для инициализации
 *              таймера, dma, spi, GPIO.
 *              - Ws2812b_NewData_1/Ws2812b_NewData_2 — Передача данных на ленту
 *
 *-----------------------------------------------------------------------------
 */

extern void Ws2812b_timer_spi_dma_gpio_init(void);

extern void Ws2812b_NewData_1(void);
extern void Ws2812b_NewData_2(void);
extern void Ws2812b_NewData_3(void);

#endif // _WS2812B_H_

/******************************************************************************
 *                                КОНЕЦ ФАЙЛА
 ******************************************************************************/
